[
    {
        "title": "Full-Stack-Verantwortung für Innovationsprojekte von ALDI Süd",
        "position": "Technology Generalist",
        "description": "Als Mitglied des kleinen aber schlagkräftigen Teams <i>Digital Business Development & Strategy</i> habe ich fachlich und technologisch breit gefächerte Verantwortung für Cloud-Infrastruktur, Architektur und Entwicklung inhouse-entwickelter Software-Prototypen, Datenanalysen sowie die Gestaltung und Optimierung technischer und geschäftlicher Prozesse übernommen. <i>Da die inhaltlichen Details der durchgeführten Projekte hochgradig wettbewerbsrelevant sind, darf ich sie momentan noch nicht preisgeben.</i>",
        "tasks": [
            "Gestaltung und Umsetzung einer projektübergreifenden serverlosen Architektur auf Basis von AWS",
            "Planung und Auswertung datengetriebener Hypothesentests",
            "Durchführung tiefer Datenanalysen",
            "Entwicklung und Betrieb verschiedener Apps, APIs und Machine-Learning-Use-Cases",
            "Planung und Entwicklung der Integration von Systemen unserer Partnerunternehmen sowie Legacy-Systemen des Konzerns",
            "DevOps - Hauptverantwortung für CI/CD und Cloud-Infrastruktur",
            "Inhaltliche Mitgestaltung digitaler Innovationen verschiedener Bereiche des Lebensmitteleinzelhandels und der Logistik"
        ],
        "keywords": ["Einzelhandel", "Logistik", "Python", "Node.js", "Grafana", "AWS", "DevOps", "Docker", "GitLab", "Spryker", "Serverless Stack", "MVP-Testing", "Advanced Analytics", "Hadoop", "Spark", "Lean Startup"]
    },
    {
        "title": "Entwicklung einer Online-Antragsstrecke für ein Versicherungsunternehmen",
        "position": "Full-Stack-Entwickler",
        "description": "Zusammen mit einem weiteren Entwickler habe ich innerhalb von drei Wochen einen kompletten Onlineabschluss für ein neues Versicherungsprodukt implementiert.",
        "tasks": [
            "Entwicklung eines Frontends auf Basis von Angular Dynamic Forms",
            "Entwicklung produktspezifischer Java-Services für das konzernweite OpenShift-Cluster",
            "Aufsetzen der CI/CD-Pipelines für das Projekt"
        ],
        "keywords": ["Versicherung", "TypeScript", "Angular 8", "Java", "Dropwizard", "REST", "OpenShift", "Jenkins", "Jira", "Scrum"]
    },
    {
        "title": "openVALIDATION",
        "position": "Full-Stack-Entwickler",
        "description": "Ich bin einer der Kernentwickler des in der <a href=\"https://www.brockhaus-ag.de\" target=\"_blank\" rel=\"noopener noreferrer\" class=\"link\">BROCKHAUS AG</a> entstandenen Open-Source-Projektes openVALIDATION (<a href=\"https://openvalidation.io\" target=\"_blank\" ref=\"noopener noreferrer\" class=\"link\">openvalidation.io</a>). Dabei handelt es sich um eine Software zur Übersetzung von Validierungsregeln aus natürlicher Sprache in lauffähigen Java-, C#-, JavaScript, oder Python-Quellcode. <i>BiPRO</i>, ein Standardisierungsverband der deutschen Versicherungsbranche, wird openVALIDATION voraussichtlich in den kommenden Schnittstellenstandard \"RNext\" aufnehmen.",
        "tasks": [
            "Strategische und technologische Mitgestaltung des Projekts",
            "Entwicklung des Python-Code-Generators",
            "Entwicklung von Features und Integrationstests",
            "Aufsetzen von CI/CD-Pipelines, Automatisierung von Maven-Releases und GitHub-Administration"
        ],
        "keywords": ["No-Code", "Java", "ANTLR", "Maven", "Python", "Codegenerierung", "Compilerentwicklnug", "Testautomatisierung", "OpenAPI", "DevOps", "GitHub", "Open Source"]
    },
    {
        "title": "PoC für KI-basierte Dokumentenverarbeitung im Medizinischen Underwriting",
        "position": "Data Scientist, KI-Entwickler",
        "description": "Ich habe ein prototypisches KI-System für die automatisierte Dokumentenverarbeitung bei einer Rückversicherung entwickelt, bestehend aus verschiedenen Python-Services und einer REST-API. Der Funktionsumfang umfasst bildbasierte Dokumentenklassifikation und semantisches Parsing von natürlich-sprachlichem Text zur Informationsextraktion in ein strukturiertes Zieldatenmodell.",
        "tasks": [
            "Architekturdesign konvolutionaler neuronaler Netze basierend auf aktuellen wissenschaftlichen Erkenntnissen",
            "Implementierung einer Semantic-Parsing-Pipeline, die Deep-Learning- und Computerlinguistik-Ansätze kombiniert",
            "Entwicklung eines Feedback-Learning-Verfahrens für die Selbstoptimierung von Machine-Learning-Modellen"
        ],
        "keywords": ["Python", "TensorFlow", "Cuda", "Konvolutionale Neuronale Netze", "SpaCy", "Computerlinguistik", "REST", "Microservices", "Dokumentenklassifizierung", "Semantic Parsing", "Azure Cloud", "Docker"]
    },
    {
        "title": "Data & Analytics in konzerninternem Digital-Startup",
        "position": "Data Scientist, Backend-Entwickler",
        "description": "Im Rahmen eines Digitalisierungsprojekts eines deutschen Verkehrskonzerns habe ich als Mitglied eines hochgradig agilen Entwicklungsteams im Lean-Startup-Format moderne Mobile-App- und API-Lösungen in den Bereichen Mobility und Entertainment erarbeitet.",
        "tasks": [
            "Konzeptionalisierung und Entwicklung KI-basierter personalisierter und kontextualisierter Content-Kuratierung",
            "Statistische Datenanalysen für datengetriebene MVP-Tests einer iOS App",
            "Unterstützung bei Planung, Entwicklung und Administration der Data-Analytics-Infrastruktur",
            "Mitglied des Architektur-Boards für eine neue API-Plattform des Konzerns auf Basis von GraphQL",
            "Allgemeine Unterstützung im Backend- und DevOps-Bereich"
        ],
        "keywords": ["Transport", "Google Cloud", "Kubernetes", "Google BigQuery", " Google DataStudio", "Google Datalab", "Firebase", "Node.js", "React Native", "iOS", "Mobile App Tracking", "A/B Testing", "Python", "Advanced Analytics", "Microservices", "Domain-driven Design", "GraphQL", "Lean Startup"]
    },
    {
        "title": "UI-Testautomatisierung und IT-Offshoring für ein Versicherungsunternehmen",
        "position": "IT Consultant",
        "description": "In einem Betriebsteam für das webbasierte Vertriebssystem eines deutschen Versicherers habe ich ein Offshoring-Projekt mit einem indischen Partnerunternehmen unterstützt.",
        "tasks": [
            "Entwurf einer Test- und Testautomatisierungsstrategie",
            "Wissenstransfer zu indischen Offshore-Mitarbeitern",
            "Prototyping von Testautomatisierungstools"
        ],
        "keywords": ["Versicherung", "Offshoring", "C#", ".NET", "Selenium", "Stichwortgetriebenes Testen", "Datengetriebenes Testen", "Teststrategie"]
    }
]