[
    {
        "title": "Full Stack Responsibility for innovation project of ALDI South",
        "position": "Technology Generalist",
        "description": "As a member of the small but powerful <i>Digital Business Development & Strategy</i> team, I have taken on professionally and technologically broad responsibilities for cloud infrastructure, architecture and development of in-house-developed software prototypes, data analysis, and the design and optimization of technical and business processes. <i>As the content details of the projects carried out are highly competitive, I am not allowed to disclose them at the moment</i>.",
        "tasks": [
            "Design and implementation of a cross-project serverless architecture based on AWS",
            "Planning and evaluation data-driven of hypothesis tests",
            "Performing deep data analytics",
            "Development and operation of various apps, APIs and machine learning use cases",
            "Planning and developing integrations of our partner companies' systems as well as legacy systems of the Group",
            "DevOps - main responsibility for CI/CD and cloud infrastructure",
            "Content co-creation of digital innovations of different areas of food retail and logistics"
        ],
        "keywords": ["Retail", "Logistik", "Python", "Node.js", "Grafana", "AWS", "DevOps", "Docker", "GitLab", "Spryker", "Serverless Stack", "MVP-Testing", "Advanced Analytics", "Hadoop", "Spark", "Lean Startup"]
    },
    {
        "title": "Development of an online insurance application",
        "position": "Full Stack Developer",
        "description": "Together with another developer, I implemented a complete online contract for a new product of a german insurance company within three weeks.",
        "tasks": [
            "Development of a frontend based on Angular Dynamic Forms",
            "Development of product-specific Java services for the group-wide OpenShift cluster",
            "Setting up the CI/CD pipelines for the project"
        ],
        "keywords": ["Insurance", "TypeScript", "Angular 8", "Java", "Dropwizard", "REST", "OpenShift", "Jenkins", "Jira", "Scrum"]
    },
    {
        "title": "openVALIDATION",
        "position": "Full Stack Developer",
        "description": "I am one of the core developers of the open source project openVALIDATION (<a href=\"https://https://openvalidation.io\" target=\"_blank\" ref=\"noopener noreferrer\" class=\"link\">openvalidation.io</a>) created at <a href=\"https://www.brockhaus-ag.de\" target=\"_blank\" rel=\"noopener noreferrer\" class=\"link\">BROCKHAUS AG</a>. It is a software for translating validation rules from natural language into executable Java, C#, JavaScript, or Python source code. <i>BiPRO</i>, a standardization association of the German insurance industry, is expected to include openVALIDATION in the upcoming interface standard \"RNext\".",
        "tasks": [
            "Strategic and technological participation the project",
            "Development of the Python code generator",
            "Development of features and integration tests",
            "Setting up CI/CD pipelines, automation of Maven releases and GitHub administration"
        ],
        "keywords": ["Java", "ANTLR", "Maven", "Python", "Code Generation", "Compiler Development", "Test Automation", "OpenAPI", "DevOps", "GitHub", "Open Source", "No-Code"]
    },
    {
        "title": "PoC for AI-based document processing in medical underwriting",
        "position": "Data Scientist, AI Engineer",
        "description": "I developed a prototype AI system for automated document processing at a reinsurance company, consisting of various Python services and a REST API. The range of functions includes image-based document classification and semantic parsing of natural language text for information extraction into a structured target data model.",
        "tasks": [
            "Architectural design of convolutional neural networks based on current scientific knowledge",
            "Implementation of a semantic parsing pipeline that combines deep learning and computational linguistic approaches",
            "Development of a feedback learning process for the self-optimization of machine learning models"
        ],
        "keywords": ["Python", "TensorFlow", "Cuda", "Convolutional Neural Networks", "SpaCy", "Computational Linguistics", "REST", "Microservices", "Document Classification", "Semantic Parsing", "Azure Cloud", "Docker"]
    },
    {
        "title": "Data & Analytics in an in-house digital startup",
        "position": "Data Scientist, Backend Developer",
        "description": "As part of a digitization project of a German transport company, I developed modern mobile app and API solutions in the areas of mobility and entertainment as a member of a highly agile development team in lean startup format.",
        "tasks": [
            "Conceptualization and development of AI-based, personalized and contextualized content curation",
            "Statistical data analysis for data-driven MVP tests of an iOS app",
            "Support in planning, development and administration of the data analytics infrastructure",
            "Member of the architecture board for a new API platform of the group based on GraphQL",
            "General support in the backend and DevOps area"
        ],
        "keywords": ["Transportation", "Google Cloud", "Kubernetes", "Google BigQuery", " Google DataStudio", "Google Datalab", "Firebase", "Node.js", "React Native", "iOS", "Mobile App Tracking", "A/B Testing", "Python", "Advanced Analytics", "Microservices", "Domain-driven Design", "GraphQL", "Lean Startup"]
    },
    {
        "title": "UI test automation and IT offshoring for an insurance company",
        "position": "IT Consultant",
        "description": "In an operating team for the web-based sales system of german insurance company, I supported an offshoring project with the Indian partner company.",
        "tasks": [
            "Design of a test and test automation strategy",
            "Knowledge transfer to Indian offshore employees",
            "Prototyping test automation tools"
        ],
        "keywords": ["Insurance", "Offshoring", "C#", ".NET", "Selenium", "Keyword-driven Testing", "Data-driven Testing", "Test Strategy"]
    }
]